Repository: guibranco/Sankhya-SDK-dotnet
Catalog: Src/Sankhya/Properties/Resources.*.resx
Languages: pt_br

source: all
pt_br: todos

source: all pages loaded
pt_br: todas as páginas carregadas

# AlreadyDisposed
source: This instance is already disposed
pt_br: Esta instância já está descartada

# CancelledOnDemandRequestWrapperException
source: Cannot add new items to a cancelled on demand request wrapper instance
pt_br: Não é possível adicionar novos itens a uma instância do wrapper de solicitação cancelada por demanda

# ConfirmInvoiceException
source: Unable to confirm invoice with single number: {0}
pt_br: Não foi possível confirmar a fatura com número único: {0}

# CreatingOrUpdating
source: creating/updating
pt_br: criando / atualizando

source: deleting
pt_br: excluindo

# EntityDynamicSerialization_ChangeKeys
source: Key count in metadata is different from key count in dictionary
pt_br: A contagem de chaves nos metadados é diferente da contagem de chaves no dicionário

# EntityExtensions_GetEntityCustomData
source: The type {0} has multiple attributes of type {1}
pt_br: O tipo {0} possui vários atributos do tipo {1}

# EntityExtensions_TypeMustInherits
source: The type {0} must inherits from {1} or must be of type {2}
pt_br: O tipo {0} deve herdar de {1} ou deve ser do tipo {2}

source: error
pt_br: erro

source: fiscal invoice status
pt_br: status da fatura fiscal

# InvalidClientEntityException
source: The type '{0}' requires the application for the client {1}
pt_br: O tipo '{0}' requer o aplicativo para o cliente {1}

# InvalidKeyFileException
source: The supplied key {0} is not valid for this session or has been deleted from the Sankhya
pt_br: A chave fornecida {0} não é válida para esta sessão ou foi excluída do Sankhya

# InvalidServiceQueryOptionsException
source: Unable to use query options with service {0}
pt_br: Não foi possível usar as opções de consulta com o serviço {0}

# InvalidServiceRequestOperationException
source: Unable to execute this operation with service {0}
pt_br: Não foi possível executar esta operação com o serviço {0}

# KnowServicesRequestWrapper_AddInvoiceItems_AddingItemsToInvoice
source: Adding {0} ite{2} to invoice with single number {1}
pt_br: Adicionando {0} ite{2} à fatura com número único {1}

# KnowServicesRequestWrapper_Bill_BillingInvoiceToTOP
source: Billing the invoice with single number {0} to TOP {1} | Billing type: {2} | Series: {3}
pt_br: Faturamento da fatura com número único {0} até TOP {1} | Tipo de cobrança: {2} | Série: {3}

# KnowServicesRequestWrapper_BindInvoiceWithOrder
source: Binding invoice with single number {0} with order. Partner code: {1} | Movement type: {2}
pt_br: Fatura vinculativa com número único {0} com pedido. Código do parceiro: {1} | Tipo de movimento: {2}

# KnowServicesRequestWrapper_CancelInvoices_Canceled
source: {0} invoice{1} canceled
pt_br: {0} fatura {1} cancelada

# KnowServicesRequestWrapper_CancelInvoices_Canceling
source: Canceling {0} invoice{1} with single number{1} {2}
pt_br: Cancelando {0} fatura {1} com número único {1} {2}

# KnowServicesRequestWrapper_ConfirmInvoice_Confirming
source: Confirming invoice with single number: {0}
pt_br: Confirmando fatura com número único: {0}

# KnowServicesRequestWrapper_CreateInvoice
source: Creating invoice header for operation {0} with {1} ite{2}
pt_br: Criando cabeçalho da fatura para a operação {0} com {1} ite{2}

# KnowServicesRequestWrapper_DeleteFiles
source: Removing {0} files from repository
pt_br: Removendo arquivos {0} do repositório

# KnowServicesRequestWrapper_DuplicateInvoice_Duplicated
source: Invoice with single number {0} duplicated, new invoice with single number: {1}
pt_br: Fatura com número único {0} duplicado, nova fatura com número único: {1}

# KnowServicesRequestWrapper_DuplicateInvoice_Duplicating
source: Duplicating invoice with single number {0} on TOP: {1} | series: {2} | exit date: {3} | update prices: {4}
pt_br: Fatura duplicada com número único {0} na parte superior: {1} | série: {2} | data de saída: {3} | atualizar preços: {4}

# KnowServicesRequestWrapper_FlagAsPaymentsPaid
source: Flagging financial movement{0} as paid: {1}
pt_br: Sinalizando o movimento financeiro {0} como pago: {1}

# KnowServicesRequestWrapper_FlagInvoicesAsNotPending
source: Flagging {0} invoice{1} with single number{1} {2} as not pending
pt_br: Sinalizar {0} fatura {1} com número único {1} {2} como não pendente

# KnowServicesRequestWrapper_GenerateLot
source: Generating lot of {0} fiscal invoice{1} with single number{1} {2}
pt_br: Gerando lote da {0} nota fiscal {1} com número único {1} {2}

# KnowServicesRequestWrapper_GetFiscalInvoiceAuthorization
source: Getting authorization of {0} fiscal invoice{1} with single number{1} {2}
pt_br: Obtendo autorização da {0} nota fiscal {1} com número único {1} {2}

# KnowServicesRequestWrapper_GetInvoiceAccompaniments
source: Getting accompaniments of {0} invoice{1} with single number{1} {2}
pt_br: Obter acompanhamentos da {0} fatura {1} com o número único {1} {2}

# KnowServicesRequestWrapper_ReceiveMessages_ReceivingMessages
source: Receiving messages
pt_br: Recebendo mensagens

# KnowServicesRequestWrapper_RemoveInvoice
source: Removing invoice with single number {0}
pt_br: Removendo fatura com número único {0}

# KnowServicesRequestWrapper_RemoveInvoiceItems_AllItemsMustBeFromTheSameInvoice
source: All items must be from the same invoice
pt_br: Todos os itens devem ser da mesma fatura

# KnowServicesRequestWrapper_RemoveInvoiceItems_DeletingItemsFromInvoice
source: Deleting {0} ite{2} from invoice with single number {1}
pt_br: Excluindo {0} ite{2} da fatura com número único {1}

# KnowServicesRequestWrapper_ReversePayments
source: Reversing financial low of movement with single number {0}
pt_br: Estorno financeiro baixo de movimento com número único {0}

# KnowServicesRequestWrapper_SendMessage_SendingMessage
source: Sending message to {0} users/groups
pt_br: Enviando mensagem para {0} usuários / grupos

# KnowServicesRequestWrapper_SendWarning_SendingWarningWithLevel
source: Sending warning with level {0} and title {1} to {2}
pt_br: Enviando aviso com nível {0} e título {1} para {2}

# KnowServicesRequestWrapper_UnlinkShipping
source: Unlink the shipping for the financial single number {0}
pt_br: Desvincule a remessa para o número único financeiro {0}

# MarkAsPaymentPaidException
source: Unable to low payments for financial numbers {0}
pt_br: Não é possível pagamentos baixos para números financeiros {0}

# MissingSerializerHelperEntityException
source: The {0} property of {1} entity (Type: {2}) is missing the serializer helper method
pt_br: A propriedade {0} da entidade {1} (Tipo: {2}) está ausente no método auxiliar do serializador

source: No
pt_br: Não

source: Yes
pt_br: Sim

source: Uninformed
pt_br: Não informado

# SimpleCRUDRequestWrapper_UpdateAsync_Invalid
source: Invalid asynchronous update request
pt_br: Solicitação de atualização assíncrona inválida

# ServiceResponseUnexpectedElementException
source: The '{0}' element is not currently being addressed in Service Response.ResponseBody for the {1} service
pt_br: O elemento '{0}' não está sendo tratado no Service Response.ResponseBody para o serviço {1}

# ServiceRequestUnexpectedResultException_Uncaught
source: The call to the {0} service resulted in the following uncaught error message: {1}
pt_br: A chamada para o serviço {0} resultou na seguinte mensagem de erro não capturada: {1}

# ServiceRequestUnexpectedResultException
source: The call to the {0} service resulted in an invalid response
pt_br: A chamada para o serviço {0} resultou em uma resposta inválida

# PagedRequestWrapper_GetManagedEnumerator
source: Got {0} items of {1} in {2}
pt_br: Obteve {0} itens de {1} em {2}

# PagedRequestWrapper_GetManagedEnumeratorInternal
source: Object disposed ignored
pt_br: Objeto descartado ignorado

# PagedRequestWrapper_GetManagedEnumerator_ErrorOccured
source: An error has occurred when loading paged request of type {0}
pt_br: Ocorreu um erro ao carregar a solicitação paginada do tipo {0}

# PagedRequestWrapper_GetManagedEnumerator_PageLoaded
source: Page {0}{1} for paged request of {2} loaded with {3} entit{4}
pt_br: Página {0} {1} para solicitação paginada de {2} carregada com {3} entidad{4}

# YPluralSuffix
source: ies
pt_br: es

# YSingularSuffix
source: y
pt_br: e

# UsersOrGroups
source: users/groups
pt_br: usuários / grupos

# UnlinkShippingException
source: Unable to unlink shipping for financial numbers {0}
pt_br: Não foi possível desvincular a remessa para números financeiros {0}

# TheValueMustHaveBetween1and6digits
source: The {0} must have between 1 and 6 digits
pt_br: O {0} deve ter entre 1 e 6 dígitos

# ServiceRequestUnbalancedDelimiterException
source: There is an unbalanced delimiter in the request
pt_br: Há um delimitador desequilibrado na solicitação

# ServiceRequestUnavailableException
source: The call to the {0} service is currently unavailable
pt_br: A chamada para o serviço {0} está indisponível no momento

# ServiceRequestTooManyResultsException
source: The request to {0} service on entity {1} resulted in {2} entities as a result. The expected was only one entity
pt_br: A solicitação para {0} atender à entidade {1} resultou em {2} entidades como resultado. O esperado era apenas uma entidade

# ServiceRequestTimeoutException
source: The call to the {0} service has timed out
pt_br: A chamada para o serviço {0} atingiu o tempo limite

# ServiceRequestRepeatedException
source: You can not use a managed request object that was already consumed
pt_br: Você não pode usar um objeto de solicitação gerenciada que já foi consumido

# ServiceRequestPropertyWidthException
source: The call to the service {0} couldn't be completed because the width of the value for the {1} property on entity {2} is above that allowed. Current width: {3}. Width allowed: {4}
pt_br: A chamada para o serviço {0} não pôde ser concluída porque a largura do valor da propriedade {1} na entidade {2} está acima da permitida. Largura atual: {3}. Largura permitida: {4}

# ServiceRequestPropertyValueException
source: The call to the service {0} couldn't find the field {1} on entity {2}
pt_br: A chamada para o serviço {0} não pôde encontrar o campo {1} na entidade {2}

# ServiceRequestPropertyNameException
source: The call to the service {0} couldn't find the field {1} on entity {2} in {3} entity request
pt_br: A chamada para o serviço {0} não pôde encontrar o campo {1} na entidade {2} na {3} solicitação da entidade

# ServiceRequestPartnerStateInscriptionException
source: Enter the word ISENTO for this type of state registration
pt_br: Digite a palavra ISENTO para este tipo de registro de estado

# ServiceRequestPartnerInvalidDocumentLengthException
source: The partner document have an invalid length
pt_br: O documento do parceiro tem um comprimento inválido

# ServiceRequestPartnerFiscalClassificationException
source: In the absence of the State registration, only the ICMS Classification: 'Non - Contributing Final Consumer' and 'Rural Producer' are permitted
pt_br: Na ausência do registro estadual, somente a Classificação do ICMS: 'Consumidor final não contribuinte' e 'Produtor rural' é permitida

# ServiceRequestPaginationException
source: Unable to complete the paged request, concurrent requests from the same user causes this error
pt_br: Não é possível concluir a solicitação paginada, solicitações simultâneas do mesmo usuário causam este erro

# ServiceRequestInvalidSubQueryException
source: The subquery returned more than 1 value. This is not allowed when the subquery follows a =,! =, <, <=,>,> = or when it is used as an expression
pt_br: A subconsulta retornou mais de 1 valor. Isso não é permitido quando a subconsulta segue a = ,! =, <, <=,>,> = ou quando é usado como expressão

# ServiceRequestInvalidRelationException
source: The relation {0} of entity {1} cannot be found on Sankhya
pt_br: A relação {0} da entidade {1} não pode ser encontrada em Sankhya

# ServiceRequestInvalidOperationException
source: Unable to process the service response
pt_br: Não foi possível processar a resposta do serviço

# ServiceRequestInvalidExpressionException
source: The filter expression '{0}' is invalid, check if it is a valid SQL expression!
pt_br: A expressão de filtro '{0}' é inválida, verifique se é uma expressão SQL válida!

# ServiceRequestInvalidCredentialsException
source: Unable to authenticate in Sankhya web service with provided credentials data
pt_br: Não foi possível autenticar no serviço da web Sankhya com dados de credenciais fornecidas

# ServiceRequestInvalidAuthorizationException
source: Attempt of unauthorized/unauthenticated access
pt_br: Tentativa de acesso não autorizado / não autenticado

# ServiceRequestInaccessibleException
source: Unable to connect to Sankhya server at address {0}:{1}
pt_br: Não foi possível conectar ao servidor Sankhya no endereço {0}: {1}

# NoItemsConfirmInvoiceException
source: Invoice {0} has no items, cannot be confirmed
pt_br: A fatura {0} não possui itens, não pode ser confirmada

# SankhyaContext_AcquireNewSession_NewSession
source: Starting new session for {0} requests
pt_br: Iniciando nova sessão para {0} solicitações

source: page loaded
pt_br: página carregada

# PagedRequestWrapper_Signaling
source: Signaling '{1}' event of type {0} for anyone who wants to listen
pt_br: Sinalizando o evento '{1}' do tipo {0} para quem quiser ouvir

# PagedRequestWrapper_LoadResponse_Waiting
source: Waiting another paged request of type {0} end. Estimated time to wait: {1}
pt_br: Aguardando outra solicitação paginada do tipo {0} final. Tempo estimado para esperar: {1}

# PagedRequestWrapper_Close
source: {0} entit{1} loaded of type {2}
pt_br: {0} entidad{1} carregada do tipo {2}

# PagedRequestException
source: There were one or more errors in the paged request below
pt_br: Houve um ou mais erros na solicitação paginada abaixo

source: Response stream is null
pt_br: O fluxo de resposta é nulo

# RemoveInvoiceException
source: Unable to remove invoice with single number: {0}
pt_br: Não foi possível remover a fatura com número único: {0}

# SankhyaContext_AcquireNewSession_NewSessionStarted
source: New session started for {0} requests with token {1}
pt_br: Nova sessão iniciada para {0} solicitações com token {1}

# SankhyaContext_Dispose_DisposingServiceContext
source: Disposing service context
pt_br: Descartando o contexto do serviço

# SankhyaContext_FinalizeSession_FinalizeSession
source: Finalizing session with token {0}
pt_br: Finalizando a sessão com o token {0}

# SankhyaWrapper_Authenticate_Authentication
source: Authenticating on Sankhya web service with username: {0}
pt_br: Autenticando no serviço da web Sankhya com nome de usuário: {0}

# SankhyaWrapper_GetFile_Getting
source: Getting file with key {0}
pt_br: Obtendo arquivo com a chave {0}

# SankhyaWrapper_GetImage_Getting
source: Getting image on entity {0} with keys: {1}
pt_br: Obtendo imagem na entidade {0} com as teclas: {1}

# SankhyaWrapper_GetImage_ImageNotFound
source: Image not found at {0}
pt_br: Imagem não encontrada em {0}

# SankhyaWrapper_ServiceInvokerInternal_CanceledQuery
source: Query canceled, probably overloaded on server. Taking {0} seconds to retry.
pt_br: Consulta cancelada, provavelmente sobrecarregada no servidor. Levando {0} segundos para tentar novamente.

# SankhyaWrapper_ServiceInvokerInternal_Module
source: ServiceInvoker -> Module: {0} | Service: {1} | Attempt: {2}
pt_br: ServiceInvoker -> Módulo: {0} | Serviço: {1} | Tentativa: {2}

# SankhyaWrapper_ServiceInvokerInternal_ReasonIdentifiedTakingSecondsRetry
source: {1} identified, taking {0} seconds to retry
pt_br: {1} identificado, levando {0} segundos para tentar novamente

# SankhyaWrapper_ServiceInvokerInternal_Service
source: ServiceInvoker -> Service: {0} | Entity: {1} | Attempt: {2}
pt_br: ServiceInvoker -> Serviço: {0} | Entidade: {1} | Tentativa: {2}

# SankhyaWrapper_ShowVersionInfo_SankhyaWVersion
source: Sankhya-W application version: {0}
pt_br: Versão do aplicativo Sankhya-W: {0}

# SankhyaWrapper_ShowVersionInfo_SankhyaWVersionNotFound
source: Sankhya-W version not found
pt_br: Versão Sankhya-W não encontrada

# ServiceRequestAttributeException
source: The service {0} requires the attribute {1}
pt_br: O serviço {0} requer o atributo {1}

# ServiceRequestBusinessRuleRestrictionException
source: The business rule {0} doesn't allow the request to be completed. Error message: {1}
pt_br: A regra de negócios {0} não permite que a solicitação seja concluída. Mensagem de erro: {1}

# ServiceRequestCompetitionException
source: The session has been identified as duplicated by Sankhya
pt_br: A sessão foi identificada como duplicada por Sankhya

# ServiceRequestDuplicatedDocumentException
source: The partner {0} has the document duplicated with another partner
pt_br: O parceiro {0} duplicou o documento com outro parceiro

# ServiceRequestExpiredAuthenticationException
source: The user's session is expired
pt_br: A sessão do usuário expirou

# ServiceRequestExtensions_ParseProperty
source: Consider changing the inline reference {0}.{1} for EntityReference in property {2} of entity {3} (Type: {4})
pt_br: Considere alterar a referência embutida {0}. {1} para EntityReference na propriedade {2} da entidade {3} (Tipo: {4})

# ServiceRequestExternalException
source: Internal Sankhya error (NPE) on call to the {0} service. Check Sankhya log file for more information
pt_br: Erro interno de Sankhya (NPE) na chamada para o serviço {0}. Verifique o arquivo de log Sankhya para obter mais informações

# ServiceRequestFileNotFoundException
source: Unable to load the file from path {0}. File or directory not found.
pt_br: Não foi possível carregar o arquivo do caminho {0}. Arquivo ou diretório não encontrado.

# ServiceRequestForeignKeyException
source: The value supplied to {0}.{1} reference isn't valid.
pt_br: O valor fornecido para {0}. {1} referência não é válido.

# ServiceRequestFullTransactionLogsException
source: The transaction logs of '{0}' database is full
pt_br: Os logs de transações do banco de dados '{0}' estão cheios

# OnDemandRequestWrapper_Dispose
source: {0} request{1} done for sending {2} entit{3} (successful: {5}) of type {4}
pt_br: {0} solicitação {1} feita para o envio de {2} autorização {3} (bem-sucedida: {5}) do tipo {4}

# OnDemandRequestWrapper_Flush
source: Emptying the queue of type {0}
pt_br: Esvaziando a fila do tipo {0}

# OnDemandRequestWrapper_OnDemandRequestWrapper_Cancelling
source: Canceling queue for type {0} with session token {1}
pt_br: Cancelando fila para o tipo {0} com token de sessão {1}

# OnDemandRequestWrapper_OnDemandRequestWrapper_Starting
source: Starting queue for the type {0} with throughput of {1} ite{2}
pt_br: Fila inicial para o tipo {0} com taxa de transferência do {1} ite{2}

# OnDemandRequestWrapper_Process
source: {0} {1} ite{2} of type {3}
pt_br: {0} {1} ite{2} do tipo {3}

# NotAllowedCorrectionFiscalInvoiceException
source: The fiscal invoice {0} with {1} {2} does not allow correction
pt_br: A fatura fiscal {0} com {1} {2} não permite correção

# OfTotal
source: of {0}
pt_br: de {0}

# OnDemandRequestWrapper_Add
source: Adding item of type {0} to queue
pt_br: Incluindo item do tipo {0} na fila

source: operation type
pt_br: tipo de operação

# ItemPluralSufix
source: ms
pt_br: ns

# PagedRequestWrapper_HandleCancellationTokenCancelled
source: Cancellation requested for request {0} {1} {2}
pt_br: Cancelamento solicitado para a solicitação {0} {1} {2}

# SankhyaWrapper_ReadStream_Exception
source: Invalid read size
pt_br: Tamanho de leitura inválido
